app/inlislite/inlislite3/common/components/DirectoryHelpers.php

SELECT * FROM `worksheets` WHERE `ID`='1'
---
    public static function GetDirWorksheet($worksheetid) {

        //jika tidak mempunyai gambar maka akan di set sampul secara default.
        $model = Worksheets::findOne($worksheetid);